app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "edited"], ["created_at", Tue, 05 Nov 2013 03:15:18 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 05 Nov 2013 03:15:18 UTC +00:00]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create!(comment_params)