app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Text"], ["created_at", Mon, 04 Nov 2013 09:04:14 UTC +00:00], ["title", "Sample Post"], ["updated_at", Mon, 04 Nov 2013 09:04:14 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save